googlecontacts/googlecontacts-connector/googlecontacts-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/googlecontacts/esb_retrieveContactGroupsByQuery_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.googlecontacts">
   <soapenv:Header/>
   <soapenv:Body>
		<urn:retrieveContactGroupsByQuery>
			<urn:appName>%s(appName)</urn:appName>
			<urn:userEmail>%s(userEmail)</urn:userEmail>
			<urn:accessToken>%s(accessToken)</urn:accessToken> 
			<urn:maxResult>Invalid Max Result</urn:maxResult>
			<urn:startIndex>10</urn:startIndex> 
			<urn:method>retrieveContactGroupsByQuery</urn:method>
		</urn:retrieveContactGroupsByQuery>
    </soapenv:Body>
</soapenv:Envelope>
